Lecture_6.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-11-29 Tue 09:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Linear regression</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Daniel Ballesteros-Chávez" />
</head>
<body>
<div id="content">
<h1 class="title">Linear regression</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1a27fec">1. Introduciton</a></li>
<li><a href="#org88d72c1">2. Estimating the Coefficients</a></li>
<li><a href="#org9cf9cae">3. Least squares method</a></li>
<li><a href="#orgc18045b">4. Covariance</a>
<ul>
<li><a href="#org9b56af4">4.1. Definition</a></li>
</ul>
</li>
<li><a href="#orgc5773be">5. Second method to obtain the coefficients</a></li>
<li><a href="#orgda9b012">6. Standard errors</a></li>
<li><a href="#org691feb2">7. Assessing the Accuracy of the Model</a></li>
<li><a href="#orgdc98ad8">8. Example</a>
<ul>
<li><a href="#orga36048b">8.1. </a></li>
</ul>
</li>
<li><a href="#org0beb226">9. \(R^2\) - statistic</a></li>
<li><a href="#orgc77e5a1">10. \(F\) - statistic</a></li>
<li><a href="#orgd3633f3">11. Multiple linear regressions.</a></li>
<li><a href="#org9412e82">12. Estimating the Regression Coefficients</a></li>
<li><a href="#org36d7488">13. Important questions</a></li>
<li><a href="#org127484c">14. Is at least one of the predictors useful?</a></li>
<li><a href="#orgdaf5e2c">15. Deciding on Important Variables</a></li>
<li><a href="#orga7ebf54">16. Deciding on Important Variables</a></li>
<li><a href="#org89f0fd7">17. Deciding on Important Variables</a>
<ul>
<li><a href="#org17a13be">17.1. Forward selection</a></li>
</ul>
</li>
<li><a href="#org1c74709">18. </a>
<ul>
<li><a href="#org016b630">18.1. Backward selection.</a></li>
<li><a href="#orgeb8c02e">18.2. Mixed selection</a></li>
</ul>
</li>
<li><a href="#org4be2c22">19. Model Fit</a></li>
<li><a href="#org602097a">20. Predictions</a></li>
<li><a href="#orgd40a3f2">21. Example</a></li>
<li><a href="#org23c8c99">22. References</a></li>
</ul>
</div>
</div>
