Lecture_notes/Lecture_6.org
* Introduciton

+ The idea behind the linear regression model is that we would like to
  predict a dependent variable $Y$ using the independent variable $X$
  assuming that they are related in a linear way.


+ This is a very simple assumption, nevertheless, linear regression is
  still a useful and widely used statistical method.

+ Many fancy statistical learning approaches can be seen as
  generalizations or extensions of linear regression. Consequently,
  the importance of having a good understanding of linear regression
  before studying more complex learning methods cannot be overstated.



This is a very basic
approach for predicting a quantitative response $Y$ on the basis of a sin-
gle predictor variable $X$. It assumes that there is approximately a linear
relationship between $X$ and $Y$.

\begin{equation}
Y  \approx  \alpha + \beta X
\end{equation}


Where the constants $\alpha$ and $\beta$ will be determined.
+ $\alpha$ is called the intercept.
+ $\beta$ is called the slope.


Hence, we would like to estimate the values of $Y$ on the basis of $X = x$. We will denote
this estimated value by $\hat{y}$. Usually the intercept and slope are also unknown, so they are to
be estimated. In this case we write
\begin{equation}
\hat{y} = \hat{\alpha} + \hat{\beta}x.
\end{equation}


* Estimating the Coefficients

In order to estimate the coefficitents $\alpha$ and $\beta$, we will
use the data we have at our disposal, for instance $\{ x_1, x_2,
\ldots, x_n\}$ and $\{ y_1, y_2, \ldots, y_n\}$.


Then we want to find the coefficient esitmates $\hat{\alpha}$ and $\hat{\beta}$ such that for
$i = 1, 2, \ldots, n$ we have
\begin{equation}
y_i \approx \hat{\alpha} + \hat{\beta}x_i.
\end{equation}

We want to find the straight line determined by $\hat{\alpha}$ and $\hat{\beta}$ 
that is as closed as possible to the $n$ pairs of points $(x_i, y_i) \in \mathbb{R}^2$, $i =1, 2, 
\ldots,n$.



For this we need a metric to decide what do we mean by /to be close to the points/.

Define the $i$ -th residual as the difference between the $i$ -th observed response (value of Y) and 
the $i$ -th predicted value by our estimation:
\begin{equation}
\begin{split}
\epsilon_i &= y_i - \hat{y}_i \\
&= y_i - \hat{\alpha} - \hat{\beta}x_i \\
\end{split}
\end{equation}



Now we define the function $g:\mathbb{R}^2 \to \mathbb{R}$ as

\begin{equation}
\begin{split}
g(\alpha, \beta)& = \sum_{i=1}^n \epsilon_i^2\\
&=\sum_{i=1}^{n}\left( y_i - \hat{\alpha} - \hat{\beta}x_i \right)^2.\\
\end{split}
\end{equation}

This function $g$ is usually called  residual sum of squares (RSS).


* Least squares method

By solving $\partial g/\partial \alpha = 0$ and $\partial g/ \partial \beta = 0$ one gets the cirtical point

\begin{equation}
\begin{split}
\hat{\beta} & = \frac{ \sum_{i=1}^{n} \left(x_i - \bar{x}\right)(y_i - \bar{y}) }{\sum_{i=1}^{n}( x_i - \bar{x})^2},\\
\hat{\alpha}& = \bar{y} - \hat{\beta}\bar{x},
\end{split}
\end{equation}

where

\begin{equation}
\bar{x}  = \frac{1}{n}\sum_{i=1}^{n} x_i, \quad \mbox{and}\quad \bar{y}  = \frac{1}{n}\sum_{i=1}^{n} y_i
\end{equation}

* Covariance

** Definition
   

For two jointly distributed real-valued random variables $X$ and $Y$ ( both with finite variance), the covariance is defined as the expected value (or mean) of the product of their deviations from their individual expected values:
\begin{equation}
\displaystyle \operatorname {cov} (X,Y)=\operatorname {E} {{\big [}(X-\operatorname {E} [X])(Y-\operatorname {E} [Y]){\big ]}} 
\end{equation}

If the random variables are descrete, this can also be writte as

\begin{equation}
\displaystyle \operatorname {cov} (X,Y)=\frac{1}{n}\sum_{i=1}^{n} {{\big [}(X_i-\overline{X})(Y_{i}-\overline{Y}){\big ]}} 
\end{equation}
 

* Second method to obtain the coefficients

By writing $\overline{X} = E[X]$, and the last definition then it is possible to write

\begin{equation}
\begin{split}
\hat{\beta}  &= \frac{\operatorname{cov} (X,Y)}{\operatorname{var}(X)},\\
\hat{\alpha} &= \operatorname{E}[Y] - \beta\operatorname{E}[X] .
\end{split}
\end{equation}

* Standard errors

Recall that by /standard error/ (deviation), we mean the  square root of the variance of an estimator,
in case of our estimate for the coefficients:

\begin{equation}
\begin{split}
\operatorname{SE}^2(\hat{\alpha}) &= \sigma^2\left[ \frac{1}{n} + \frac{\bar{x}^2}{\sum_{i=1}^n (x_i - \overline{x})^2}\right], \\
\operatorname{SE}^2(\hat{\beta}) &= \frac{\sigma^2}{\sum_{i=1}^n (x_i - \overline{x})^2}.
\end{split}
\end{equation}

Where  $\sigma^2 = \mbox{Var}(\epsilon)$. In general, $\sigma$ is not known, but can be estimated from the data. 
This estimate is known as the /residual standard error/, and is given by the formula

\begin{equation}
\mbox{RSE} = \sqrt{\frac{\mbox{RSS}}{n-2}}
\end{equation}

Roughly speaking, it is the average amount that the response
will deviate from the true regression line.

* Assessing the Accuracy of the Model

Standard errors can also be used to perform hypothesis tests on the
coefficients. The most common hypothesis test involves testing the null
hypothesis of

$H_0$ : There is no relationship between $X$ and $Y$.

$H_1$ : There is a relationship between $X$ and $Y$.

Equivalently:

\begin{equation}
\begin{split}
H_0 : \beta = 0,\\
H_1 : \beta \neq 0.\\
\end{split}
\end{equation}


This usually uses the $t$ -statistic
\begin{equation}
t = \frac{\hat{\beta} - 0}{\mbox{SE}(\hat{\beta})}.
\end{equation}

If there really is no relationship between X and Y , then we expect
that $t$ will have a t-distribution with n − 2 degrees of freedom.

/We reject the null hypothesis/ — that is, we declare a relationship
to exist between X and Y — if the p-value is small enough.

* Example

The linear model is implemented in R via the function =lm=.

From the data set iris, contrast the columns for /Sepal length/ and 
/Petal length/ and fit a linear model:
** 
# :PROPERTIES:
# :BEAMER_OPT: shrink=50
# :END:

\tiny
#+begin_example R
df  <-  iris
model01  <-  lm(df$Sepal.Length ~ df$Petal.Length)
summary(model01)

Call:
lm(formula = df$Sepal.Length ~ df$Petal.Length)

Residuals:
     Min       1Q   Median       3Q      Max 
-1.24675 -0.29657 -0.01515  0.27676  1.00269 

Coefficients:
                Estimate Std. Error t value Pr(>|t|)    
(Intercept)      4.30660    0.07839   54.94   <2e-16 ***
df$Petal.Length  0.40892    0.01889   21.65   <2e-16 ***
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

Residual standard error: 0.4071 on 148 degrees of freedom
Multiple R-squared:   0.76,	Adjusted R-squared:  0.7583 
F-statistic: 468.6 on 1 and 148 DF,  p-value: < 2.2e-16

#+end_example

#+RESULTS:

