Lecture_6.html


<div id="outline-container-org1a27fec" class="outline-2">
<h2 id="org1a27fec"><span class="section-number-2">1</span> Introduciton</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>The idea behind the linear regression model is that we would like to
predict a dependent variable \(Y\) using the independent variable \(X\)
assuming that they are related in a linear way.</li>
</ul>


<ul class="org-ul">
<li>This is a very simple assumption, nevertheless, linear regression is
still a useful and widely used statistical method.</li>

<li>Many fancy statistical learning approaches can be seen as
generalizations or extensions of linear regression. Consequently,
the importance of having a good understanding of linear regression
before studying more complex learning methods cannot be overstated.</li>
</ul>



<p>
This is a very basic
approach for predicting a quantitative response \(Y\) on the basis of a sin-
gle predictor variable \(X\). It assumes that there is approximately a linear
relationship between \(X\) and \(Y\).
</p>

\begin{equation}
Y  \approx  \alpha + \beta X
\end{equation}


<p>
Where the constants \(\alpha\) and \(\beta\) will be determined.
</p>
<ul class="org-ul">
<li>\(\alpha\) is called the intercept.</li>
<li>\(\beta\) is called the slope.</li>
</ul>


<p>
Hence, we would like to estimate the values of \(Y\) on the basis of \(X = x\). We will denote
this estimated value by \(\hat{y}\). Usually the intercept and slope are also unknown, so they are to
be estimated. In this case we write
</p>
\begin{equation}
\hat{y} = \hat{\alpha} + \hat{\beta}x.
\end{equation}
</div>
</div>


<div id="outline-container-org88d72c1" class="outline-2">
<h2 id="org88d72c1"><span class="section-number-2">2</span> Estimating the Coefficients</h2>
<div class="outline-text-2" id="text-2">
<p>
In order to estimate the coefficitents \(\alpha\) and \(\beta\), we will
use the data we have at our disposal, for instance \(\{ x_1, x_2,
\ldots, x_n\}\) and \(\{ y_1, y_2, \ldots, y_n\}\).
</p>


<p>
Then we want to find the coefficient esitmates \(\hat{\alpha}\) and \(\hat{\beta}\) such that for
\(i = 1, 2, \ldots, n\) we have
</p>
\begin{equation}
y_i \approx \hat{\alpha} + \hat{\beta}x_i.
\end{equation}

<p>
We want to find the straight line determined by \(\hat{\alpha}\) and \(\hat{\beta}\) 
that is as closed as possible to the \(n\) pairs of points \((x_i, y_i) \in \mathbb{R}^2\), \(i =1, 2, 
\ldots,n\).
</p>



<p>
For this we need a metric to decide what do we mean by <i>to be close to the points</i>.
</p>

<p>
Define the \(i\) -th residual as the difference between the \(i\) -th observed response (value of Y) and 
the \(i\) -th predicted value by our estimation:
</p>
\begin{equation}
\begin{split}
\epsilon_i &= y_i - \hat{y}_i \\
&= y_i - \hat{\alpha} - \hat{\beta}x_i \\
\end{split}
\end{equation}



<p>
Now we define the function \(g:\mathbb{R}^2 \to \mathbb{R}\) as
</p>

\begin{equation}
\begin{split}
g(\alpha, \beta)& = \sum_{i=1}^n \epsilon_i^2\\
&=\sum_{i=1}^{n}\left( y_i - \hat{\alpha} - \hat{\beta}x_i \right)^2.\\
\end{split}
\end{equation}

<p>
This function \(g\) is usually called  residual sum of squares (RSS).
</p>
</div>
</div>


<div id="outline-container-org9cf9cae" class="outline-2">
<h2 id="org9cf9cae"><span class="section-number-2">3</span> Least squares method</h2>
<div class="outline-text-2" id="text-3">
<p>
By solving \(\partial g/\partial \alpha = 0\) and \(\partial g/ \partial \beta = 0\) one gets the cirtical point
</p>

\begin{equation}
\begin{split}
\hat{\beta} & = \frac{ \sum_{i=1}^{n} \left(x_i - \bar{x}\right)(y_i - \bar{y}) }{\sum_{i=1}^{n}( x_i - \bar{x})^2},\\
\hat{\alpha}& = \bar{y} - \hat{\beta}\bar{x},
\end{split}
\end{equation}

<p>
where
</p>

\begin{equation}
\bar{x}  = \frac{1}{n}\sum_{i=1}^{n} x_i, \quad \mbox{and}\quad \bar{y}  = \frac{1}{n}\sum_{i=1}^{n} y_i
\end{equation}
</div>
</div>

<div id="outline-container-orgc18045b" class="outline-2">
<h2 id="orgc18045b"><span class="section-number-2">4</span> Covariance</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org9b56af4" class="outline-3">
<h3 id="org9b56af4"><span class="section-number-3">4.1</span> Definition</h3>
<div class="outline-text-3" id="text-4-1">
<p>
For two jointly distributed real-valued random variables \(X\) and \(Y\) ( both with finite variance), the covariance is defined as the expected value (or mean) of the product of their deviations from their individual expected values:
</p>
\begin{equation}
\displaystyle \operatorname {cov} (X,Y)=\operatorname {E} {{\big [}(X-\operatorname {E} [X])(Y-\operatorname {E} [Y]){\big ]}} 
\end{equation}

<p>
If the random variables are descrete, this can also be writte as
</p>

\begin{equation}
\displaystyle \operatorname {cov} (X,Y)=\frac{1}{n}\sum_{i=1}^{n} {{\big [}(X_i-\overline{X})(Y_{i}-\overline{Y}){\big ]}} 
\end{equation}
</div>
</div>
</div>


<div id="outline-container-orgc5773be" class="outline-2">
<h2 id="orgc5773be"><span class="section-number-2">5</span> Second method to obtain the coefficients</h2>
<div class="outline-text-2" id="text-5">
<p>
By writing \(\overline{X} = E[X]\), and the last definition then it is possible to write
</p>

\begin{equation}
\begin{split}
\hat{\beta}  &= \frac{\operatorname{cov} (X,Y)}{\operatorname{var}(X)},\\
\hat{\alpha} &= \operatorname{E}[Y] - \beta\operatorname{E}[X] .
\end{split}
\end{equation}
</div>
</div>

<div id="outline-container-orgda9b012" class="outline-2">
<h2 id="orgda9b012"><span class="section-number-2">6</span> Standard errors</h2>
<div class="outline-text-2" id="text-6">
<p>
Recall that by <i>standard error</i> (deviation), we mean the  square root of the variance of an estimator,
in case of our estimate for the coefficients:
</p>

\begin{equation}
\begin{split}
\operatorname{SE}^2(\hat{\alpha}) &= \sigma^2\left[ \frac{1}{n} + \frac{\bar{x}^2}{\sum_{i=1}^n (x_i - \overline{x})^2}\right], \\
\operatorname{SE}^2(\hat{\beta}) &= \frac{\sigma^2}{\sum_{i=1}^n (x_i - \overline{x})^2}.
\end{split}
\end{equation}

<p>
Where  \(\sigma^2 = \mbox{Var}(\epsilon)\). In general, \(\sigma\) is not known, but can be estimated from the data. 
This estimate is known as the <i>residual standard error</i>, and is given by the formula
</p>

\begin{equation}
\mbox{RSE} = \sqrt{\frac{\mbox{RSS}}{n-2}}
\end{equation}

<p>
Roughly speaking, it is the average amount that the response
will deviate from the true regression line.
</p>
</div>
</div>

<div id="outline-container-org691feb2" class="outline-2">
<h2 id="org691feb2"><span class="section-number-2">7</span> Assessing the Accuracy of the Model</h2>
<div class="outline-text-2" id="text-7">
<p>
Standard errors can also be used to perform hypothesis tests on the
coefficients. The most common hypothesis test involves testing the null
hypothesis of
</p>

<p>
\(H_0\) : There is no relationship between \(X\) and \(Y\).
</p>

<p>
\(H_1\) : There is a relationship between \(X\) and \(Y\).
</p>

<p>
Equivalently:
</p>

\begin{equation}
\begin{split}
H_0 : \beta = 0,\\
H_1 : \beta \neq 0.\\
\end{split}
\end{equation}


<p>
This usually uses the \(t\) -statistic
</p>
\begin{equation}
t = \frac{\hat{\beta} - 0}{\mbox{SE}(\hat{\beta})}.
\end{equation}

<p>
If there really is no relationship between X and Y , then we expect
that \(t\) will have a t-distribution with n − 2 degrees of freedom.
</p>

<p>
<i>We reject the null hypothesis</i> — that is, we declare a relationship
to exist between X and Y — if the p-value is small enough.
</p>
</div>
</div>

<div id="outline-container-orgdc98ad8" class="outline-2">
<h2 id="orgdc98ad8"><span class="section-number-2">8</span> Example</h2>
<div class="outline-text-2" id="text-8">
<p>
The linear model is implemented in R via the function <code>lm</code>.
</p>

<p>
From the data set iris, contrast the columns for <i>Sepal length</i> and 
<i>Petal length</i> and fit a linear model:
</p>
</div>
<div id="outline-container-orga36048b" class="outline-3">
<h3 id="orga36048b"><span class="section-number-3">8.1</span> </h3>
<div class="outline-text-3" id="text-8-1">
<p>
\tiny
</p>
<pre class="example">
df  &lt;-  iris
model01  &lt;-  lm(df$Sepal.Length ~ df$Petal.Length)
summary(model01)

Call:
lm(formula = df$Sepal.Length ~ df$Petal.Length)

Residuals:
     Min       1Q   Median       3Q      Max 
-1.24675 -0.29657 -0.01515  0.27676  1.00269 

Coefficients:
                Estimate Std. Error t value Pr(&gt;|t|)    
(Intercept)      4.30660    0.07839   54.94   &lt;2e-16 ***
df$Petal.Length  0.40892    0.01889   21.65   &lt;2e-16 ***
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

Residual standard error: 0.4071 on 148 degrees of freedom
Multiple R-squared:   0.76,	Adjusted R-squared:  0.7583 
F-statistic: 468.6 on 1 and 148 DF,  p-value: &lt; 2.2e-16

</pre>
</div>
</div>
</div>
