Lecture_notes/Lecture_6.org
* $R^2$ - statistic

The $R^2$ statistic is a measure of the linear (sample) relationship between $X$ and
$Y$ namely $\mbox{cor}(X,Y)$. It is also a measure of the linear relationship between X and Y .

\begin{equation}
R^2 = \frac{\mbox{TSS} - \mbox{RSS}}{\mbox{TSS}}  = 1 - \frac{\mbox{RSS}}{\mbox{TSS}}
\end{equation}

Here

\begin{equation}
\mbox{TSS} = \sum_{i=1}^{n} (y_i - \overline{y})^2.
\end{equation}


An $R^2$ statistic that is
close to 1 indicates that a large proportion of the variability in the response
has been explained by the regression. A number near 0 indicates that the
regression did not explain much of the variability in the response; this might
occur because the linear model is wrong, or the inherent error $\sigma^2$ is high,
or both.


* $F$ - statistic

This is used in multiple linear regression when we want to fit 
\begin{equation}
Y = \alpha + \sum_{j=1}^{p} \beta_{j} X_j + \epsilon.
\end{equation}

It is defined by
\begin{equation}
F = \frac{\mbox{TSS} - \mbox{RSS}}{\mbox{RSS}} \cdot \frac{ n-p-1}{p}.
\end{equation}

Hence, when there is no relationship between the response and predictors,
one would expect the F-statistic to take on a value close to 1. And on the other hand
if $F$ is greater than $1$ then the hypothesis that at least one of the $\beta_i$'s is
different from zero have strong evidence.


* Multiple linear regressions.

Simple linear regression is a useful approach for predicting a response on the
basis of a single predictor variable. However, in practice we often have more
than one predictor.

One option is to run three separate simple linear regressions, each of
which uses a different independent variable as a predictor.

Instead of fitting a separate simple linear regression model for each predictor,
 a better approach is to extend the simple linear regression model
so that it can directly accommodate multiple predictors.

This is used in multiple linear regression when we want to fit 
\begin{equation}
Y = \alpha + \sum_{j=1}^{p} \beta_{j} X_j + \epsilon.
\end{equation}



* Estimating the Regression Coefficients

As in the case of Simple linear regression, we look to minimise the residual sum squared:

\begin{equation}
\mbox{RSS} = \sum_{i=1}^{n} (y_i - \alpha - \beta_1 x_{i1} - \beta_2 x_{i2} - \cdots \beta_p x_{ip} ) ^2.
\end{equation}


And we proceed as in the  simple linear case.

* Important questions


1) Is at least one of the predictors $X_1 , X_2 , \dots , X_p$ useful in predicting the response?
2)  Do all the predictors help to explain Y , or is only a subset of the predictors useful?
3)  How well does the model fit the data?
4) Given a set of predictor values, what response value should we predict, and how accurate is our prediction?


* Is at least one of the predictors useful?

The approach of using an $F$ -statistic to test for any association between
the predictors and the response works when $p$ is relatively small, and 
certainly small compared to $n$. However, sometimes we have a very large number
 of variables. If p > n then there are more coefficients $\beta_j$ to estimate
than observations from which to estimate them. In this case we cannot
even fit the multiple linear regression model using least squares, so the
$F$ -statistic cannot be used, and neither can most of the other concepts that
we have seen so far


* Deciding on Important Variables

Ideally, we would like to perform variable selection by trying out a lot of
different models, each containing a different subset of the predictors. For
instance, if $p = 2$, then we can consider four models: 

1) a model containing no variables, 
2) a model containing $X_1$ only, 
3) a model containing $X_2$ only, 
4) a model containing both $X_1$ and $X_2$ .


* Deciding on Important Variables

We can then select the best model out of all of the models that we have considered. How
do we determine which model is best? Various statistics can be used to
judge the quality of a model. 

These include 

+ Mallow’s C_p , 
+ Akaike informa-tion criterion (AIC), 
+ Bayesian information criterion (BIC), 
+ Adjusted $R^2$.


* Deciding on Important Variables

Unless p is very
small, we cannot consider all $2^p$ models, and instead we need an automated
and efficient approach to choose a smaller set of models to consider. There
are three classical approaches for this task:

** Forward selection

We begin with the null model—a model that con-
tains an intercept but no predictors. We then fit p simple linear re-
gressions and add to the null model the variable that results in the
lowest RSS. We then add to that model the variable that results
in the lowest RSS for the new two-variable model. This approach is
continued until some stopping rule is satisfied.

* 

** Backward selection.

We start with all variables in the model, and
remove the variable with the largest p-value—that is, the variable
that is the least statistically significant. The new $(p - 1)$ -variable
model is fit, and the variable with the largest p-value is removed. This
procedure continues until a stopping rule is reached. For instance, we
may stop when all remaining variables have a p-value below some
threshold.
Backward selection cannot be used if $p > n$.

** Mixed selection

This is a combination of forward and backward se-
lection. We start with no variables in the model, and as with forward
selection, we add the variable that provides the best fit. We con-
tinue to add variables one-by-one.

If at any point the
p-value for one of the variables in the model rises above a certain
threshold, then we remove that variable from the model. We con-
tinue to perform these forward and backward steps until all variables
in the model have a sufficiently low p-value, and all variables outside
the model would have a large p-value if added to the model.


* Model Fit

Two of the most common numerical measures of model fit are the RSE and
$R^2$ , the fraction of variance explained. These quantities are computed and
interpreted in the same fashion as for simple linear regression.

