Lecture_6.html

<div id="outline-container-org0beb226" class="outline-2">
<h2 id="org0beb226"><span class="section-number-2">9</span> \(R^2\) - statistic</h2>
<div class="outline-text-2" id="text-9">
<p>
The \(R^2\) statistic is a measure of the linear (sample) relationship between \(X\) and
\(Y\) namely \(\mbox{cor}(X,Y)\). It is also a measure of the linear relationship between X and Y .
</p>

\begin{equation}
R^2 = \frac{\mbox{TSS} - \mbox{RSS}}{\mbox{TSS}}  = 1 - \frac{\mbox{RSS}}{\mbox{TSS}}
\end{equation}

<p>
Here
</p>

\begin{equation}
\mbox{TSS} = \sum_{i=1}^{n} (y_i - \overline{y})^2.
\end{equation}


<p>
An \(R^2\) statistic that is
close to 1 indicates that a large proportion of the variability in the response
has been explained by the regression. A number near 0 indicates that the
regression did not explain much of the variability in the response; this might
occur because the linear model is wrong, or the inherent error \(\sigma^2\) is high,
or both.
</p>
</div>
</div>


<div id="outline-container-orgc77e5a1" class="outline-2">
<h2 id="orgc77e5a1"><span class="section-number-2">10</span> \(F\) - statistic</h2>
<div class="outline-text-2" id="text-10">
<p>
This is used in multiple linear regression when we want to fit 
</p>
\begin{equation}
Y = \alpha + \sum_{j=1}^{p} \beta_{j} X_j + \epsilon.
\end{equation}

<p>
It is defined by
</p>
\begin{equation}
F = \frac{\mbox{TSS} - \mbox{RSS}}{\mbox{RSS}} \cdot \frac{ n-p-1}{p}.
\end{equation}

<p>
Hence, when there is no relationship between the response and predictors,
one would expect the F-statistic to take on a value close to 1. And on the other hand
if \(F\) is greater than \(1\) then the hypothesis that at least one of the \(\beta_i\)'s is
different from zero have strong evidence.
</p>
</div>
</div>


<div id="outline-container-orgd3633f3" class="outline-2">
<h2 id="orgd3633f3"><span class="section-number-2">11</span> Multiple linear regressions.</h2>
<div class="outline-text-2" id="text-11">
<p>
Simple linear regression is a useful approach for predicting a response on the
basis of a single predictor variable. However, in practice we often have more
than one predictor.
</p>

<p>
One option is to run three separate simple linear regressions, each of
which uses a different independent variable as a predictor.
</p>

<p>
Instead of fitting a separate simple linear regression model for each predictor,
 a better approach is to extend the simple linear regression model
so that it can directly accommodate multiple predictors.
</p>

<p>
This is used in multiple linear regression when we want to fit 
</p>
\begin{equation}
Y = \alpha + \sum_{j=1}^{p} \beta_{j} X_j + \epsilon.
\end{equation}
</div>
</div>



<div id="outline-container-org9412e82" class="outline-2">
<h2 id="org9412e82"><span class="section-number-2">12</span> Estimating the Regression Coefficients</h2>
<div class="outline-text-2" id="text-12">
<p>
As in the case of Simple linear regression, we look to minimise the residual sum squared:
</p>

\begin{equation}
\mbox{RSS} = \sum_{i=1}^{n} (y_i - \alpha - \beta_1 x_{i1} - \beta_2 x_{i2} - \cdots \beta_p x_{ip} ) ^2.
\end{equation}


<p>
And we proceed as in the  simple linear case.
</p>
</div>
</div>

<div id="outline-container-org36d7488" class="outline-2">
<h2 id="org36d7488"><span class="section-number-2">13</span> Important questions</h2>
<div class="outline-text-2" id="text-13">
<ol class="org-ol">
<li>Is at least one of the predictors \(X_1 , X_2 , \dots , X_p\) useful in predicting the response?</li>
<li>Do all the predictors help to explain Y , or is only a subset of the predictors useful?</li>
<li>How well does the model fit the data?</li>
<li>Given a set of predictor values, what response value should we predict, and how accurate is our prediction?</li>
</ol>
</div>
</div>


<div id="outline-container-org127484c" class="outline-2">
<h2 id="org127484c"><span class="section-number-2">14</span> Is at least one of the predictors useful?</h2>
<div class="outline-text-2" id="text-14">
<p>
The approach of using an \(F\) -statistic to test for any association between
the predictors and the response works when \(p\) is relatively small, and 
certainly small compared to \(n\). However, sometimes we have a very large number
 of variables. If p &gt; n then there are more coefficients \(\beta_j\) to estimate
than observations from which to estimate them. In this case we cannot
even fit the multiple linear regression model using least squares, so the
\(F\) -statistic cannot be used, and neither can most of the other concepts that
we have seen so far
</p>
</div>
</div>


<div id="outline-container-orgdaf5e2c" class="outline-2">
<h2 id="orgdaf5e2c"><span class="section-number-2">15</span> Deciding on Important Variables</h2>
<div class="outline-text-2" id="text-15">
<p>
Ideally, we would like to perform variable selection by trying out a lot of
different models, each containing a different subset of the predictors. For
instance, if \(p = 2\), then we can consider four models: 
</p>

<ol class="org-ol">
<li>a model containing no variables,</li>
<li>a model containing \(X_1\) only,</li>
<li>a model containing \(X_2\) only,</li>
<li>a model containing both \(X_1\) and \(X_2\) .</li>
</ol>
</div>
</div>


<div id="outline-container-orga7ebf54" class="outline-2">
<h2 id="orga7ebf54"><span class="section-number-2">16</span> Deciding on Important Variables</h2>
<div class="outline-text-2" id="text-16">
<p>
We can then select the best model out of all of the models that we have considered. How
do we determine which model is best? Various statistics can be used to
judge the quality of a model. 
</p>

<p>
These include 
</p>

<ul class="org-ul">
<li>Mallow’s C<sub>p</sub> ,</li>
<li>Akaike informa-tion criterion (AIC),</li>
<li>Bayesian information criterion (BIC),</li>
<li>Adjusted \(R^2\).</li>
</ul>
</div>
</div>


<div id="outline-container-org89f0fd7" class="outline-2">
<h2 id="org89f0fd7"><span class="section-number-2">17</span> Deciding on Important Variables</h2>
<div class="outline-text-2" id="text-17">
<p>
Unless p is very
small, we cannot consider all \(2^p\) models, and instead we need an automated
and efficient approach to choose a smaller set of models to consider. There
are three classical approaches for this task:
</p>
</div>

<div id="outline-container-org17a13be" class="outline-3">
<h3 id="org17a13be"><span class="section-number-3">17.1</span> Forward selection</h3>
<div class="outline-text-3" id="text-17-1">
<p>
We begin with the null model—a model that con-
tains an intercept but no predictors. We then fit p simple linear re-
gressions and add to the null model the variable that results in the
lowest RSS. We then add to that model the variable that results
in the lowest RSS for the new two-variable model. This approach is
continued until some stopping rule is satisfied.
</p>
</div>
</div>
</div>

<div id="outline-container-org1c74709" class="outline-2">
<h2 id="org1c74709"><span class="section-number-2">18</span> </h2>
<div class="outline-text-2" id="text-18">
</div>
<div id="outline-container-org016b630" class="outline-3">
<h3 id="org016b630"><span class="section-number-3">18.1</span> Backward selection.</h3>
<div class="outline-text-3" id="text-18-1">
<p>
We start with all variables in the model, and
remove the variable with the largest p-value—that is, the variable
that is the least statistically significant. The new \((p - 1)\) -variable
model is fit, and the variable with the largest p-value is removed. This
procedure continues until a stopping rule is reached. For instance, we
may stop when all remaining variables have a p-value below some
threshold.
Backward selection cannot be used if \(p > n\).
</p>
</div>
</div>

<div id="outline-container-orgeb8c02e" class="outline-3">
<h3 id="orgeb8c02e"><span class="section-number-3">18.2</span> Mixed selection</h3>
<div class="outline-text-3" id="text-18-2">
<p>
This is a combination of forward and backward se-
lection. We start with no variables in the model, and as with forward
selection, we add the variable that provides the best fit. We con-
tinue to add variables one-by-one.
</p>

<p>
If at any point the
p-value for one of the variables in the model rises above a certain
threshold, then we remove that variable from the model. We con-
tinue to perform these forward and backward steps until all variables
in the model have a sufficiently low p-value, and all variables outside
the model would have a large p-value if added to the model.
</p>
</div>
</div>
</div>


<div id="outline-container-org4be2c22" class="outline-2">
<h2 id="org4be2c22"><span class="section-number-2">19</span> Model Fit</h2>
<div class="outline-text-2" id="text-19">
<p>
Two of the most common numerical measures of model fit are the RSE and
\(R^2\) , the fraction of variance explained. These quantities are computed and
interpreted in the same fashion as for simple linear regression.
</p>
</div>
</div>
