Lecture_notes/Lecture_6.org
* Predictions

There are three sorts of uncertainty associated with the Linear Model 

+ We can compute a confidence interval in order to determine how close $\hat{Y}$ will be to $f(X)$.
+ Model bias: we use a linear model, we are in fact estimating the best linear approximation to the true surface. However, here we will ignore this discrepancy, and operate as if the linear model were correct.
+ We use prediction intervals to answer how much will $Y$ vary from
  $\hat{Y}$ ponitwise. Prediction intervals are always wider than
  confidence intervals, because they incorporate both the error in the
  estimate for f (X) (the reducible error) and the uncertainty as to
  how much an individual point will differ from the population
  regression plane


I found this nice video.

[[https://www.youtube.com/watch?v=qVCQi0KPR0s]]


* Example
:PROPERTIES:
:BEAMER_OPT: shrink=40
:END:



#+begin_example
fit <- lm(Petal.Width ~ Petal.Length, data=iris)

plot(Petal.Width ~ Petal.Length, col=c("black", "red", "blue")[Species], 
pch=(15:17)[Species], 
xlab="Petal Length (cm)", ylab="Petal Width (cm)", data=iris)
newx <- data.frame(Petal.Length=seq(min(iris$Petal.Length), max(iris$Petal.Length), length.out=100))
conf.interval <- predict(fit, newdata=newx, interval="confidence")
pred.interval <- predict(fit, newdata=newx, interval="prediction")
lines(conf.interval[, "fit"] ~ newx[, 1], lty=1, lw=3)
lines(conf.interval[, "lwr"] ~ newx[, 1], lty=2)
lines(conf.interval[, "upr"] ~ newx[, 1], lty=2)
lines(pred.interval[, "lwr"] ~ newx[, 1], lty=3)
lines(pred.interval[, "upr"] ~ newx[, 1], lty=3)
legend("topleft", legend=c(levels(iris$Species), "CI", "PI"), 
col=c("black", "red", "blue", "black", "black"), 
pch=c(15:17, -1, -1), lty=c(-1, -1, -1, 2, 3))
#+end_example


from [[https://rpubs.com/lwaldron/iris_regression]]

* References

[1] Gareth James, Daniela Witten, Trevor Hastie and Robert Tibshirani /An Introduction to Statistical Learning/. Springer Texts in Statistics, 2014.
