Lecture_6.html

<div id="outline-container-org602097a" class="outline-2">
<h2 id="org602097a"><span class="section-number-2">20</span> Predictions</h2>
<div class="outline-text-2" id="text-20">
<p>
There are three sorts of uncertainty associated with the Linear Model 
</p>

<ul class="org-ul">
<li>We can compute a confidence interval in order to determine how close \(\hat{Y}\) will be to \(f(X)\).</li>
<li>Model bias: we use a linear model, we are in fact estimating the best linear approximation to the true surface. However, here we will ignore this discrepancy, and operate as if the linear model were correct.</li>
<li>We use prediction intervals to answer how much will \(Y\) vary from
\(\hat{Y}\) ponitwise. Prediction intervals are always wider than
confidence intervals, because they incorporate both the error in the
estimate for f (X) (the reducible error) and the uncertainty as to
how much an individual point will differ from the population
regression plane</li>
</ul>


<p>
I found this nice video.
</p>

<p>
<a href="https://www.youtube.com/watch?v=qVCQi0KPR0s">https://www.youtube.com/watch?v=qVCQi0KPR0s</a>
</p>
</div>
</div>


<div id="outline-container-orgd40a3f2" class="outline-2">
<h2 id="orgd40a3f2"><span class="section-number-2">21</span> Example</h2>
<div class="outline-text-2" id="text-21">
<pre class="example">
fit &lt;- lm(Petal.Width ~ Petal.Length, data=iris)

plot(Petal.Width ~ Petal.Length, col=c("black", "red", "blue")[Species], 
pch=(15:17)[Species], 
xlab="Petal Length (cm)", ylab="Petal Width (cm)", data=iris)
newx &lt;- data.frame(Petal.Length=seq(min(iris$Petal.Length), max(iris$Petal.Length), length.out=100))
conf.interval &lt;- predict(fit, newdata=newx, interval="confidence")
pred.interval &lt;- predict(fit, newdata=newx, interval="prediction")
lines(conf.interval[, "fit"] ~ newx[, 1], lty=1, lw=3)
lines(conf.interval[, "lwr"] ~ newx[, 1], lty=2)
lines(conf.interval[, "upr"] ~ newx[, 1], lty=2)
lines(pred.interval[, "lwr"] ~ newx[, 1], lty=3)
lines(pred.interval[, "upr"] ~ newx[, 1], lty=3)
legend("topleft", legend=c(levels(iris$Species), "CI", "PI"), 
col=c("black", "red", "blue", "black", "black"), 
pch=c(15:17, -1, -1), lty=c(-1, -1, -1, 2, 3))
</pre>


<p>
from <a href="https://rpubs.com/lwaldron/iris_regression">https://rpubs.com/lwaldron/iris_regression</a>
</p>
</div>
</div>

<div id="outline-container-org23c8c99" class="outline-2">
<h2 id="org23c8c99"><span class="section-number-2">22</span> References</h2>
<div class="outline-text-2" id="text-22">
<p>
[1] Gareth James, Daniela Witten, Trevor Hastie and Robert Tibshirani <i>An Introduction to Statistical Learning</i>. Springer Texts in Statistics, 2014.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Ballesteros-Chávez</p>
<p class="date">Created: 2022-11-29 Tue 09:39</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
